In [1]:
import os
import pandas as pd
import numpy as np

In [2]:
#Read in and merge two data records.
school_datapath = "schools_complete.csv"
student_datapath = "students_complete.csv"
school_data = pd.read_csv(school_datapath)
student_data = pd.read_csv(student_datapath)

all_data = pd.merge(school_data, student_data, on=["school_name", "school_name"], how="left")
all_data.head(2)

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61

In [3]:
#Verify present data types in dataframe
all_data.dtypes

School ID         int64
school_name      object
type             object
size              int64
budget            int64
Student ID        int64
student_name     object
gender           object
grade            object
reading_score     int64
math_score        int64
dtype: object

In [4]:
#Calculate the total number of schools 
school_count = len(all_data["school_name"].unique())
school_count

15

In [5]:
#List all school names for "School Summary"
school_name = all_data["school_name"].unique()
school_name

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

In [6]:
#List types of schools
school_type = all_data["type"].unique()
school_type

array(['District', 'Charter'], dtype=object)

In [7]:
#Get the total of all the Students
#use len like above
student_count = len(all_data["student_name"].unique())
student_count

32715

In [8]:

#Calculate the total budget
budget_total = all_data["budget"].sum()
budget_total

82932329558

In [9]:
#Calculate the average math score
ave_math = all_data["math_score"].mean()
round(ave_math, 1)

79.0

In [10]:
#Calculate the average reading score
ave_reading = all_data["reading_score"].mean()
round(ave_reading, 1)

81.9

In [11]:
#Calculate the passing rate 
pass_rate = (ave_math + ave_reading)/2
pass_rate
round(pass_rate, 1)

80.4

In [12]:
#isolate math and reading scores
sc_df = all_data[["math_score", "reading_score"]]
sc_df.head()

   math_score  reading_score
0          79             66
1          61             94
2          60             90
3          58             67
4          84             97

In [13]:
#Dataframe for only passing math and reading scores
pass_df = sc_df.loc[(sc_df["math_score"] > 69.9) | (sc_df["reading_score"] > 69.9), :]
pass_df.head()

   math_score  reading_score
0          79             66
1          61             94
2          60             90
4          84             97
5          94             94

In [14]:
#calculate percentage of students with a passing math score
pass_math = (pass_df["math_score"].sum() / student_count)
round(pass_math, 1)
#use loc for average

91.3

In [15]:
#Calculate the percentage of students with a passing reading score 
pass_read = (pass_df["reading_score"].sum() / student_count)
round(pass_read, 1)

94.6

In [16]:
#District Summary 
District_Summary = [{"Total Schools": "15", "Total Students": "32,715", "Total Budget": "$82,932,329,558", "Average Math Score": "79", "Average Reading Score": "81.9", "% Passing Math": "91.3", "% Passing Reading": "94.6", "Overall Passing Rate": "94.6"}]
summary_df = pd.DataFrame(District_Summary)
summary_df

,% Passing Math,% Passing Reading,Average Math Score,Average Reading Score,Overall Passing Rate,Total Budget,Total Schools,Total Students
0,91.3,94.6,79,81.9,94.6,"$82,932,329,558",15,"32,715"

In [17]:
#Huang HS Summary 
Huang_HS = all_data.loc[(all_data["school_name"] == "Huang High School"), :]
Huang_HS.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61
2,0,Huang High School,District,2917,1910635,2,Kevin Rodriguez,M,12th,90,60
3,0,Huang High School,District,2917,1910635,3,Dr. Richard Scott,M,12th,67,58
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84

In [18]:
HHSave_math = Huang_HS["math_score"].mean()
round(HHSave_math, 1)

76.6

In [19]:
HHSave_reading = Huang_HS["reading_score"].mean()
round(HHSave_reading, 1)

81.2

In [20]:
HHStudent_tot = len(Huang_HS["student_name"].unique())
HHStudent_tot

2858

In [21]:
HHSBudper_st = Huang_HS.iloc[0,4] / HHStudent_tot
HHSBudper_st
round(HHSBudper_st, 1)

668.5

In [22]:
HHSpass_df = Huang_HS.loc[(Huang_HS["math_score"] > 69.9) | (Huang_HS["reading_score"] > 69.9), :]
HHSpass_df.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61
2,0,Huang High School,District,2917,1910635,2,Kevin Rodriguez,M,12th,90,60
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84
5,0,Huang High School,District,2917,1910635,5,Bryan Miranda,M,9th,94,94

In [23]:
HHSpass_read = (HHSpass_df["reading_score"].sum() / HHStudent_tot)
round(HHSpass_read, 1)

78.5

In [24]:
HHSpass_math = (HHSpass_df["math_score"].sum() / HHStudent_tot)
round(HHSpass_math, 1)

74.1

In [25]:
#Calculate the total passing rate 
HHSpass_rate = (HHSave_math + HHSave_reading)/2
HHSpass_rate
round(HHSpass_rate, 1)

78.9

In [26]:
#Figueroa High School Summary
F_HS = all_data.loc[(all_data["school_name"] == "Figueroa High School"), :]
F_HS.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
2917,1,Figueroa High School,District,2949,1884411,2917,Amy Jacobs,F,10th,85,87
2918,1,Figueroa High School,District,2949,1884411,2918,Nathan Campbell,M,12th,97,84
2919,1,Figueroa High School,District,2949,1884411,2919,Randall Stewart,M,12th,67,77
2920,1,Figueroa High School,District,2949,1884411,2920,Jennifer Brown,F,9th,97,64
2921,1,Figueroa High School,District,2949,1884411,2921,Denise Lopez,F,10th,79,64

In [27]:
FHSave_math = F_HS["math_score"].mean()
round(FHSave_math, 1)

76.7

In [28]:
FHSave_reading = F_HS["reading_score"].mean()
round(FHSave_reading, 1)

81.2

In [29]:
FHStudent_tot = len(F_HS["student_name"].unique())
FHStudent_tot

2886

In [30]:
FHSBudper_st = F_HS.iloc[0,4] / FHStudent_tot
FHSBudper_st
round(FHSBudper_st, 1)

652.9

In [31]:
FHSpass_df = F_HS.loc[(F_HS["math_score"] > 69.9) | (F_HS["reading_score"] > 69.9), :]
FHSpass_df.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
2917,1,Figueroa High School,District,2949,1884411,2917,Amy Jacobs,F,10th,85,87
2918,1,Figueroa High School,District,2949,1884411,2918,Nathan Campbell,M,12th,97,84
2919,1,Figueroa High School,District,2949,1884411,2919,Randall Stewart,M,12th,67,77
2920,1,Figueroa High School,District,2949,1884411,2920,Jennifer Brown,F,9th,97,64
2921,1,Figueroa High School,District,2949,1884411,2921,Denise Lopez,F,10th,79,64

In [32]:
FHSpass_read = (FHSpass_df["reading_score"].sum() / FHStudent_tot)
round(FHSpass_read, 1)

78.6

In [33]:
FHSpass_math = (FHSpass_df["math_score"].sum() / FHStudent_tot)
round(FHSpass_math, 1)

74.3

In [34]:
#Calculate the total passing rate 
FHSpass_rate = (FHSave_math + FHSave_reading)/2
FHSpass_rate
round(FHSpass_rate, 1)

78.9

In [35]:
#Shelton High School Summary 
S_HS = all_data.loc[(all_data["school_name"] == "Shelton High School"), :]
S_HS.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
5866,2,Shelton High School,Charter,1761,1056600,5866,Jamie Montgomery,F,12th,70,91
5867,2,Shelton High School,Charter,1761,1056600,5867,Shannon Phillips,F,10th,84,71
5868,2,Shelton High School,Charter,1761,1056600,5868,Todd Barber,M,11th,95,99
5869,2,Shelton High School,Charter,1761,1056600,5869,Desiree King,F,12th,76,95
5870,2,Shelton High School,Charter,1761,1056600,5870,Melissa Roberts,F,10th,71,82

In [36]:
SHSave_math = S_HS["math_score"].mean()
round(FHSave_math, 1)

76.7

In [37]:
SHSave_reading = S_HS["reading_score"].mean()
round(SHSave_reading, 1)

83.7

In [38]:
SHStudent_tot = len(S_HS["student_name"].unique())
SHStudent_tot

1738

In [39]:
SHSBudper_st = S_HS.iloc[0,4] / SHStudent_tot
SHSBudper_st
round(SHSBudper_st, 1)

607.9

In [40]:
SHSpass_df = S_HS.loc[(S_HS["math_score"] > 69.9) | (S_HS["reading_score"] > 69.9), :]
SHSpass_df.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
5866,2,Shelton High School,Charter,1761,1056600,5866,Jamie Montgomery,F,12th,70,91
5867,2,Shelton High School,Charter,1761,1056600,5867,Shannon Phillips,F,10th,84,71
5868,2,Shelton High School,Charter,1761,1056600,5868,Todd Barber,M,11th,95,99
5869,2,Shelton High School,Charter,1761,1056600,5869,Desiree King,F,12th,76,95
5870,2,Shelton High School,Charter,1761,1056600,5870,Melissa Roberts,F,10th,71,82

In [41]:
SHSpass_read = (SHSpass_df["reading_score"].sum() / SHStudent_tot)
round(SHSpass_read, 1)

84.7

In [42]:
SHSpass_math = (SHSpass_df["math_score"].sum() / SHStudent_tot)
round(SHSpass_math, 1)

84.3

In [43]:
#Calculate the total passing rate 
SHSpass_rate = (SHSave_math + SHSave_reading)/2
SHSpass_rate
round(SHSpass_rate, 1)

83.5

In [44]:
#Hernandez High School Summary 
HZ_HS = all_data.loc[(all_data["school_name"] == "Hernandez High School"), :]
HZ_HS.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
7627,3,Hernandez High School,District,4635,3022020,7627,Russell Davis,M,10th,70,88
7628,3,Hernandez High School,District,4635,3022020,7628,Timothy Walker,M,12th,97,93
7629,3,Hernandez High School,District,4635,3022020,7629,Katie Johnston,F,12th,83,81
7630,3,Hernandez High School,District,4635,3022020,7630,Joann Oconnell,F,12th,77,91
7631,3,Hernandez High School,District,4635,3022020,7631,Sarah Alexander,F,10th,84,93

In [45]:
HZHSave_math = HZ_HS["math_score"].mean()
round(HZHSave_math, 1)

77.3

In [46]:
HZHSave_reading = HZ_HS["reading_score"].mean()
round(HZHSave_reading, 1)

80.9

In [47]:
HZHStudent_tot = len(HZ_HS["student_name"].unique())
HZHStudent_tot

4501

In [48]:
HZHSBudper_st = HZ_HS.iloc[0,4] / HZHStudent_tot
HZHSBudper_st
round(HZHSBudper_st, 1)

671.4

In [49]:
HZHSpass_df = HZ_HS.loc[(HZ_HS["math_score"] > 69.9) | (HZ_HS["reading_score"] > 69.9), :]
HZHSpass_df.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
7627,3,Hernandez High School,District,4635,3022020,7627,Russell Davis,M,10th,70,88
7628,3,Hernandez High School,District,4635,3022020,7628,Timothy Walker,M,12th,97,93
7629,3,Hernandez High School,District,4635,3022020,7629,Katie Johnston,F,12th,83,81
7630,3,Hernandez High School,District,4635,3022020,7630,Joann Oconnell,F,12th,77,91
7631,3,Hernandez High School,District,4635,3022020,7631,Sarah Alexander,F,10th,84,93

In [50]:
HZHSpass_read = (HZHSpass_df["reading_score"].sum() / HZHStudent_tot)
round(HZHSpass_read, 1)

79.3

In [51]:
HZHSpass_math = (HZHSpass_df["math_score"].sum() / HZHStudent_tot)
round(HZHSpass_math, 1)

75.8

In [52]:
#Calculate the total passing rate 
HZHSpass_rate = (HZHSave_math + HZHSave_reading)/2
HZHSpass_rate
round(HZHSpass_rate, 1)

79.1

In [53]:
#Griffin High School Summary 
G_HS = all_data.loc[(all_data["school_name"] == "Griffin High School"), :]
G_HS.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
12262,4,Griffin High School,Charter,1468,917500,12262,Heather Wright,F,11th,79,68
12263,4,Griffin High School,Charter,1468,917500,12263,Elizabeth Goodwin,F,10th,91,81
12264,4,Griffin High School,Charter,1468,917500,12264,Michelle Wong,F,9th,78,89
12265,4,Griffin High School,Charter,1468,917500,12265,Scott Roth MD,M,11th,91,85
12266,4,Griffin High School,Charter,1468,917500,12266,Billy Wilson,M,12th,76,83

In [54]:
GHSave_math = G_HS["math_score"].mean()
round(GHSave_math, 1)

83.4

In [55]:
GHSave_reading = G_HS["reading_score"].mean()
round(GHSave_reading, 1)

83.8

In [56]:
GHStudent_tot = len(G_HS["student_name"].unique())
GHStudent_tot

1449

In [57]:
GHSBudper_st = G_HS.iloc[0,4] / GHStudent_tot
GHSBudper_st
round(GHSBudper_st, 1)

633.2

In [58]:
GHSpass_df = G_HS.loc[(G_HS["math_score"] > 69.9) | (G_HS["reading_score"] > 69.9), :]
GHSpass_df.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
12262,4,Griffin High School,Charter,1468,917500,12262,Heather Wright,F,11th,79,68
12263,4,Griffin High School,Charter,1468,917500,12263,Elizabeth Goodwin,F,10th,91,81
12264,4,Griffin High School,Charter,1468,917500,12264,Michelle Wong,F,9th,78,89
12265,4,Griffin High School,Charter,1468,917500,12265,Scott Roth MD,M,11th,91,85
12266,4,Griffin High School,Charter,1468,917500,12266,Billy Wilson,M,12th,76,83

In [59]:
GHSpass_read = (GHSpass_df["reading_score"].sum() / GHStudent_tot)
round(GHSpass_read, 1)

84.9

In [60]:
GHSpass_math = (GHSpass_df["math_score"].sum() / GHStudent_tot)
round(GHSpass_math, 1)

84.4

In [61]:
#Calculate the total passing rate 
GHSpass_rate = (GHSave_math + GHSave_reading)/2
GHSpass_rate
round(GHSpass_rate, 1)

83.6

In [62]:
#Wilson High School Summary

In [63]:
W_HS = all_data.loc[(all_data["school_name"] == "Wilson High School"), :]
W_HS.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
13730,5,Wilson High School,Charter,2283,1319574,13730,Kelli Anderson,F,10th,84,71
13731,5,Wilson High School,Charter,2283,1319574,13731,Russell Ramirez,M,10th,72,87
13732,5,Wilson High School,Charter,2283,1319574,13732,Eric Butler,M,10th,97,82
13733,5,Wilson High School,Charter,2283,1319574,13733,Warren Kerr,M,11th,93,68
13734,5,Wilson High School,Charter,2283,1319574,13734,Gail Hall,F,9th,79,72

In [64]:
WHSave_math = W_HS["math_score"].mean()
round(WHSave_math, 1)

83.3

In [65]:
WHSave_reading = W_HS["reading_score"].mean()
round(WHSave_reading, 1)

84.0

In [66]:
WHStudent_tot = len(W_HS["student_name"].unique())
WHStudent_tot

2248

In [67]:
WHSBudper_st = W_HS.iloc[0,4] / WHStudent_tot
WHSBudper_st
round(WHSBudper_st, 1)

587.0

In [68]:
WHSpass_df = W_HS.loc[(W_HS["math_score"] > 69.9) | (W_HS["reading_score"] > 69.9), :]
WHSpass_df.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
13730,5,Wilson High School,Charter,2283,1319574,13730,Kelli Anderson,F,10th,84,71
13731,5,Wilson High School,Charter,2283,1319574,13731,Russell Ramirez,M,10th,72,87
13732,5,Wilson High School,Charter,2283,1319574,13732,Eric Butler,M,10th,97,82
13733,5,Wilson High School,Charter,2283,1319574,13733,Warren Kerr,M,11th,93,68
13734,5,Wilson High School,Charter,2283,1319574,13734,Gail Hall,F,9th,79,72

In [69]:
WHSpass_read = (WHSpass_df["reading_score"].sum() / WHStudent_tot)
round(WHSpass_read, 1)

85.2

In [70]:
WHSpass_math = (WHSpass_df["math_score"].sum() / WHStudent_tot)
round(WHSpass_math, 1)

84.4

In [71]:
#Calculate the total passing rate 
WHSpass_rate = (WHSave_math + WHSave_reading)/2
WHSpass_rate
round(WHSpass_rate, 1)

83.6

In [72]:
#Cabrera High School Summary 
C_HS = all_data.loc[(all_data["school_name"] == "Cabrera High School"), :]
C_HS.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
16013,6,Cabrera High School,Charter,1858,1081356,16013,Olivia Short,F,11th,94,94
16014,6,Cabrera High School,Charter,1858,1081356,16014,Kerry Jones,F,9th,98,97
16015,6,Cabrera High School,Charter,1858,1081356,16015,Bruce Jackson,M,12th,78,83
16016,6,Cabrera High School,Charter,1858,1081356,16016,Amy Green,F,12th,89,92
16017,6,Cabrera High School,Charter,1858,1081356,16017,Melanie Mason,F,12th,96,71

In [73]:
CHSave_math = C_HS["math_score"].mean()
round(CHSave_math, 1)

83.1

In [74]:
CHSave_reading = C_HS["reading_score"].mean()
round(CHSave_reading, 1)

84.0

In [75]:
CHStudent_tot = len(C_HS["student_name"].unique())
CHStudent_tot

1834

In [76]:
CHSBudper_st = C_HS.iloc[0,4] / CHStudent_tot
CHSBudper_st
round(CHSBudper_st, 1)

589.6

In [77]:
CHSpass_df = C_HS.loc[(C_HS["math_score"] > 69.9) | (C_HS["reading_score"] > 69.9), :]
CHSpass_df.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
16013,6,Cabrera High School,Charter,1858,1081356,16013,Olivia Short,F,11th,94,94
16014,6,Cabrera High School,Charter,1858,1081356,16014,Kerry Jones,F,9th,98,97
16015,6,Cabrera High School,Charter,1858,1081356,16015,Bruce Jackson,M,12th,78,83
16016,6,Cabrera High School,Charter,1858,1081356,16016,Amy Green,F,12th,89,92
16017,6,Cabrera High School,Charter,1858,1081356,16017,Melanie Mason,F,12th,96,71

In [78]:
CHSpass_read = (CHSpass_df["reading_score"].sum() / CHStudent_tot)
round(CHSpass_read, 1)

85.0

In [79]:
CHSpass_math = (CHSpass_df["math_score"].sum() / CHStudent_tot)
round(CHSpass_math, 1)

84.0

In [80]:
#Calculate the total passing rate 
CHSpass_rate = (CHSave_math + CHSave_reading)/2
CHSpass_rate
round(CHSpass_rate, 1)

83.5

In [81]:
#Bailey High School Summary 
B_HS = all_data.loc[(all_data["school_name"] == "Bailey High School"), :]
B_HS.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
17871,7,Bailey High School,District,4976,3124928,17871,Blake Martin,M,9th,75,59
17872,7,Bailey High School,District,4976,3124928,17872,Kathryn Kane,F,12th,84,58
17873,7,Bailey High School,District,4976,3124928,17873,Richard Haas,M,11th,79,86
17874,7,Bailey High School,District,4976,3124928,17874,Frank Marsh,M,9th,71,89
17875,7,Bailey High School,District,4976,3124928,17875,Charles Goodman Jr.,M,9th,90,61

In [82]:
BHSave_math = B_HS["math_score"].mean()
round(BHSave_math, 1)

77.0

In [83]:
BHSave_reading = B_HS["reading_score"].mean()
round(BHSave_reading, 1)

81.0

In [84]:
BHStudent_tot = len(B_HS["student_name"].unique())
BHStudent_tot

4799

In [85]:
BHSBudper_st = B_HS.iloc[0,4] / BHStudent_tot
BHSBudper_st
round(BHSBudper_st, 1)

651.2

In [86]:
BHSpass_df = B_HS.loc[(B_HS["math_score"] > 69.9) | (B_HS["reading_score"] > 69.9), :]
BHSpass_df.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
17871,7,Bailey High School,District,4976,3124928,17871,Blake Martin,M,9th,75,59
17872,7,Bailey High School,District,4976,3124928,17872,Kathryn Kane,F,12th,84,58
17873,7,Bailey High School,District,4976,3124928,17873,Richard Haas,M,11th,79,86
17874,7,Bailey High School,District,4976,3124928,17874,Frank Marsh,M,9th,71,89
17875,7,Bailey High School,District,4976,3124928,17875,Charles Goodman Jr.,M,9th,90,61

In [87]:
BHSpass_read = (BHSpass_df["reading_score"].sum() / BHStudent_tot)
round(BHSpass_read, 1)

79.9

In [88]:
BHSpass_math = (BHSpass_df["math_score"].sum() / BHStudent_tot)
round(BHSpass_math, 1)

76.0

In [89]:
#Calculate the total passing rate 
BHSpass_rate = (BHSave_math + BHSave_reading)/2
BHSpass_rate
round(BHSpass_rate, 1)

79.0

In [90]:
#Holden High School Summary 
HO_HS = all_data.loc[(all_data["school_name"] == "Holden High School"), :]
HO_HS.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
22847,8,Holden High School,Charter,427,248087,22847,Daniel Rodriguez,M,11th,86,92
22848,8,Holden High School,Charter,427,248087,22848,Bryan Perkins,M,9th,91,81
22849,8,Holden High School,Charter,427,248087,22849,Scott Holder,M,9th,98,93
22850,8,Holden High School,Charter,427,248087,22850,Troy Jackson,M,11th,80,90
22851,8,Holden High School,Charter,427,248087,22851,William Gomez,M,9th,76,85

In [91]:
HOHSave_math = HO_HS["math_score"].mean()
round(HOHSave_math, 1)

83.8

In [92]:
HOHSave_reading = HO_HS["reading_score"].mean()
round(HOHSave_reading, 1)

83.8

In [93]:
HOHStudent_tot = len(HO_HS["student_name"].unique())
HOHStudent_tot

424

In [94]:
HOHSBudper_st = HO_HS.iloc[0,4] / HOHStudent_tot
HOHSBudper_st
round(HOHSBudper_st, 1)

585.1

In [95]:
HOHSpass_df = HO_HS.loc[(HO_HS["math_score"] > 69.9) | (HO_HS["reading_score"] > 69.9), :]
HOHSpass_df.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
22847,8,Holden High School,Charter,427,248087,22847,Daniel Rodriguez,M,11th,86,92
22848,8,Holden High School,Charter,427,248087,22848,Bryan Perkins,M,9th,91,81
22849,8,Holden High School,Charter,427,248087,22849,Scott Holder,M,9th,98,93
22850,8,Holden High School,Charter,427,248087,22850,Troy Jackson,M,11th,80,90
22851,8,Holden High School,Charter,427,248087,22851,William Gomez,M,9th,76,85

In [96]:
HOHSpass_read = (HOHSpass_df["reading_score"].sum() / HOHStudent_tot)
round(HOHSpass_read, 1)

84.1

In [97]:
HOHSpass_math = (HOHSpass_df["math_score"].sum() / HOHStudent_tot)
round(HOHSpass_math, 1)

84.1

In [98]:
#Calculate the total passing rate 
HOHSpass_rate = (HOHSave_math + HOHSave_reading)/2
HOHSpass_rate
round(HOHSpass_rate, 1)

83.8

In [99]:
#Pena High School Summary 
P_HS = all_data.loc[(all_data["school_name"] == "Pena High School"), :]
P_HS.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
23274,9,Pena High School,Charter,962,585858,23274,Alec Davis,M,9th,91,75
23275,9,Pena High School,Charter,962,585858,23275,Michael Meyer,M,10th,94,76
23276,9,Pena High School,Charter,962,585858,23276,Donald Gutierrez,M,11th,98,91
23277,9,Pena High School,Charter,962,585858,23277,Travis Chavez,M,11th,78,71
23278,9,Pena High School,Charter,962,585858,23278,Sheena Ball,F,12th,87,92

In [100]:
PHSave_math = P_HS["math_score"].mean()
round(PHSave_math, 1)

83.8

In [101]:
PHSave_reading = P_HS["reading_score"].mean()
round(PHSave_reading, 1)

84.0

In [102]:
PHStudent_tot = len(P_HS["student_name"].unique())
PHStudent_tot

955

In [103]:
PHSBudper_st = P_HS.iloc[0,4] / PHStudent_tot
PHSBudper_st
round(PHSBudper_st, 1)

613.5

In [104]:
PHSpass_df = P_HS.loc[(P_HS["math_score"] > 69.9) | (P_HS["reading_score"] > 69.9), :]
PHSpass_df.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
23274,9,Pena High School,Charter,962,585858,23274,Alec Davis,M,9th,91,75
23275,9,Pena High School,Charter,962,585858,23275,Michael Meyer,M,10th,94,76
23276,9,Pena High School,Charter,962,585858,23276,Donald Gutierrez,M,11th,98,91
23277,9,Pena High School,Charter,962,585858,23277,Travis Chavez,M,11th,78,71
23278,9,Pena High School,Charter,962,585858,23278,Sheena Ball,F,12th,87,92

In [105]:
PHSpass_read = (PHSpass_df["reading_score"].sum() / PHStudent_tot)
round(PHSpass_read, 1)

84.7

In [106]:
PHSpass_math = (PHSpass_df["math_score"].sum() / PHStudent_tot)
round(PHSpass_math, 1)

84.5

In [107]:
#Calculate the total passing rate 
PHSpass_rate = (PHSave_math + PHSave_reading)/2
PHSpass_rate
round(PHSpass_rate, 1)

83.9

In [108]:
#Wright High School Summary 
WT_HS = all_data.loc[(all_data["school_name"] == "Wright High School"), :]
WT_HS.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
24236,10,Wright High School,Charter,1800,1049400,24236,Aaron Johnson,M,10th,89,72
24237,10,Wright High School,Charter,1800,1049400,24237,Kimberly Hamilton,F,10th,84,93
24238,10,Wright High School,Charter,1800,1049400,24238,Ashley Johns,F,10th,88,88
24239,10,Wright High School,Charter,1800,1049400,24239,Stephanie Donovan,F,10th,75,84
24240,10,Wright High School,Charter,1800,1049400,24240,Cynthia Guzman,F,11th,93,82

In [109]:
WTHSave_math = WT_HS["math_score"].mean()
round(WTHSave_math, 1)

83.7

In [110]:
WTHSave_reading = WT_HS["reading_score"].mean()
round(WTHSave_reading, 1)

84.0

In [111]:
WTHStudent_tot = len(WT_HS["student_name"].unique())
WTHStudent_tot

1783

In [112]:
WTHSBudper_st = WT_HS.iloc[0,4] / WTHStudent_tot
WTHSBudper_st
round(WTHSBudper_st, 1)

588.6

In [113]:
WTHSpass_df = WT_HS.loc[(WT_HS["math_score"] > 69.9) | (WT_HS["reading_score"] > 69.9), :]
WTHSpass_df.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
24236,10,Wright High School,Charter,1800,1049400,24236,Aaron Johnson,M,10th,89,72
24237,10,Wright High School,Charter,1800,1049400,24237,Kimberly Hamilton,F,10th,84,93
24238,10,Wright High School,Charter,1800,1049400,24238,Ashley Johns,F,10th,88,88
24239,10,Wright High School,Charter,1800,1049400,24239,Stephanie Donovan,F,10th,75,84
24240,10,Wright High School,Charter,1800,1049400,24240,Cynthia Guzman,F,11th,93,82

In [114]:
WTHSpass_read = (WTHSpass_df["reading_score"].sum() / WTHStudent_tot)
round(WTHSpass_read, 1)

84.5

In [115]:
WTHSpass_math = (WTHSpass_df["math_score"].sum() / WTHStudent_tot)
round(WTHSpass_math, 1)

84.2

In [116]:
#Calculate the total passing rate 
WTHSpass_rate = (WTHSave_math + WTHSave_reading)/2
WTHSpass_rate
round(WTHSpass_rate, 1)

83.8

In [117]:
#Rodriguez High School Summary 
R_HS = all_data.loc[(all_data["school_name"] == "Rodriguez High School"), :]
R_HS.head(2)

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
26036,11,Rodriguez High School,District,3999,2547363,26036,Sherry Jenkins,F,11th,74,81
26037,11,Rodriguez High School,District,3999,2547363,26037,Kimberly Calderon,F,10th,80,86

In [118]:
RHSave_math = R_HS["math_score"].mean()
round(RHSave_math, 1)

76.8

In [119]:
RHSave_reading = R_HS["reading_score"].mean()
round(RHSave_reading, 1)

80.7

In [120]:
RHStudent_tot = len(R_HS["student_name"].unique())
RHStudent_tot

3902

In [121]:
RHSBudper_st = R_HS.iloc[0,4] / RHStudent_tot
RHSBudper_st
round(RHSBudper_st, 1)

652.8

In [122]:
RHSpass_df = R_HS.loc[(R_HS["math_score"] > 69.9) | (R_HS["reading_score"] > 69.9), :]
RHSpass_df.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
26036,11,Rodriguez High School,District,3999,2547363,26036,Sherry Jenkins,F,11th,74,81
26037,11,Rodriguez High School,District,3999,2547363,26037,Kimberly Calderon,F,10th,80,86
26038,11,Rodriguez High School,District,3999,2547363,26038,William Brady,M,11th,97,62
26039,11,Rodriguez High School,District,3999,2547363,26039,Jacob Padilla,M,11th,79,73
26040,11,Rodriguez High School,District,3999,2547363,26040,Paula Maldonado,F,10th,96,92

In [123]:
RHSpass_read = (RHSpass_df["reading_score"].sum() / RHStudent_tot)
round(RHSpass_read, 1)

78.4

In [124]:
RHSpass_math = (RHSpass_df["math_score"].sum() / RHStudent_tot)
round(RHSpass_math, 1)

74.7

In [125]:
#Calculate the total passing rate 
RHSpass_rate = (RHSave_math + RHSave_reading)/2
RHSpass_rate
round(RHSpass_rate, 1)

78.8

In [126]:
#Johnson High School Summary 
J_HS = all_data.loc[(all_data["school_name"] == "Johnson High School"), :]
J_HS.head(2)

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
30035,12,Johnson High School,District,4761,3094650,30035,Lisa Casey,F,12th,87,87
30036,12,Johnson High School,District,4761,3094650,30036,Jessica Lopez,F,9th,98,62

In [127]:
JHSave_math = J_HS["math_score"].mean()
round(JHSave_math, 1)

77.1

In [128]:
JHSave_reading = J_HS["reading_score"].mean()
round(JHSave_reading, 1)

81.0

In [129]:
JHStudent_tot = len(J_HS["student_name"].unique())
JHStudent_tot

4618

In [130]:
JHSBudper_st = J_HS.iloc[0,4] / JHStudent_tot
JHSBudper_st
round(JHSBudper_st, 1)

670.1

In [131]:
JHSpass_df = J_HS.loc[(J_HS["math_score"] > 69.9) | (J_HS["reading_score"] > 69.9), :]
JHSpass_df.head(2)

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
30035,12,Johnson High School,District,4761,3094650,30035,Lisa Casey,F,12th,87,87
30036,12,Johnson High School,District,4761,3094650,30036,Jessica Lopez,F,9th,98,62

In [132]:
JHSpass_read = (JHSpass_df["reading_score"].sum() / JHStudent_tot)
round(JHSpass_read, 1)

79.2

In [133]:
JHSpass_math = (JHSpass_df["math_score"].sum() / JHStudent_tot)
round(JHSpass_math, 1)

75.5

In [134]:
#Calculate the total passing rate 
JHSpass_rate = (JHSave_math + JHSave_reading)/2
JHSpass_rate
round(JHSpass_rate, 1)

79.0

In [135]:
#Ford High School Summary 
FD_HS = all_data.loc[(all_data["school_name"] == "Ford High School"), :]
FD_HS.head(2)

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
34796,13,Ford High School,District,2739,1763916,34796,Michael Mercado,M,9th,66,94
34797,13,Ford High School,District,2739,1763916,34797,Stephen Wolf,M,11th,68,63

In [136]:
FDHSave_math = FD_HS["math_score"].mean()
round(FDHSave_math, 1)

77.1

In [137]:
FDHSave_reading = FD_HS["reading_score"].mean()
round(FDHSave_reading, 1)

80.7

In [138]:
FDHStudent_tot = len(FD_HS["student_name"].unique())
FDHStudent_tot

2676

In [139]:
FDHSBudper_st = FD_HS.iloc[0,4] / FDHStudent_tot
FDHSBudper_st
round(FDHSBudper_st, 1)

659.2

In [140]:
FDHSpass_df = FD_HS.loc[(FD_HS["math_score"] > 69.9) | (FD_HS["reading_score"] > 69.9), :]
FDHSpass_df.head(2)

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
34796,13,Ford High School,District,2739,1763916,34796,Michael Mercado,M,9th,66,94
34798,13,Ford High School,District,2739,1763916,34798,Bonnie Hughes,F,12th,73,59

In [141]:
FDHSpass_read = (FDHSpass_df["reading_score"].sum() / FDHStudent_tot)
round(FDHSpass_read, 1)

78.1

In [142]:
FDHSpass_math = (FDHSpass_df["math_score"].sum() / FDHStudent_tot)
round(FDHSpass_math, 1)

74.7

In [143]:
#Calculate the total passing rate 
FDHSpass_rate = (FDHSave_math + FDHSave_reading)/2
FDHSpass_rate
round(FDHSpass_rate, 1)

78.9

In [144]:
#Thomas High School Summary 
T_HS = all_data.loc[(all_data["school_name"] == "Thomas High School"), :]
T_HS.head(2)

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
37535,14,Thomas High School,Charter,1635,1043130,37535,Norma Mata,F,10th,76,76
37536,14,Thomas High School,Charter,1635,1043130,37536,Cody Miller,M,11th,84,82

In [145]:
THSave_math = T_HS["math_score"].mean()
round(THSave_math, 1)

83.4

In [146]:
THSave_reading = T_HS["reading_score"].mean()
round(THSave_reading, 1)

83.8

In [147]:
THStudent_tot = len(T_HS["student_name"].unique())
THStudent_tot

1619

In [148]:
THSBudper_st = T_HS.iloc[0,4] / THStudent_tot
THSBudper_st
round(THSBudper_st, 1)

644.3

In [149]:
THSpass_df = T_HS.loc[(T_HS["math_score"] > 69.9) | (T_HS["reading_score"] > 69.9), :]
THSpass_df.head(2)

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
37535,14,Thomas High School,Charter,1635,1043130,37535,Norma Mata,F,10th,76,76
37536,14,Thomas High School,Charter,1635,1043130,37536,Cody Miller,M,11th,84,82

In [150]:
THSpass_read = (THSpass_df["reading_score"].sum() / THStudent_tot)
round(THSpass_read, 1)

84.4

In [151]:
THSpass_math = (THSpass_df["math_score"].sum() / THStudent_tot)
round(THSpass_math, 1)

84.0

In [152]:
#Calculate the total passing rate 
THSpass_rate = (THSave_math + THSave_reading)/2
THSpass_rate
round(THSpass_rate, 1)

83.6

In [153]:
# Master School Summary
School_Summary = pd.DataFrame([
{"School Name": "Huang High School", "Type": "District", "Total Students": HHStudent_tot, "Total School Budget": "1,910,635", "Budget Per Student": HHSBudper_st, "Ave Math Score": HHSave_math, "Ave Reading": HHSave_reading, "% Pass Math": HHSpass_math, "Total Pass Rate": HHSpass_rate},
{"School Name": "Figueroa High School", "Type": "District", "Total Students": FHStudent_tot, "Total School Budget": "1,884,411", "Budget Per Student": FHSBudper_st, "Ave Math Score": FHSave_math, "Ave Reading": FHSave_reading, "% Pass Math": FHSpass_math, "Total Pass Rate": FHSpass_rate},
{"School Name": "Shelton High School", "Type": "Charter", "Total Students": SHStudent_tot, "Total School Budget": "1,056,600", "Budget Per Student": SHSBudper_st, "Ave Math Score": SHSave_math, "Ave Reading": SHSave_reading, "% Pass Math": SHSpass_math, "Total Pass Rate": SHSpass_rate},
{"School Name": "Hernandez High School", "Type": "District", "Total Students": HZHStudent_tot, "Total School Budget": "3,022,020", "Budget Per Student": HZHSBudper_st, "Ave Math Score": HZHSave_math, "Ave Reading": HZHSave_reading, "% Pass Math": HZHSpass_math, "Total Pass Rate": HZHSpass_rate},
{"School Name": "Griffin High School", "Type": "Charter", "Total Students": GHStudent_tot, "Total School Budget": "917,500", "Budget Per Student": GHSBudper_st, "Ave Math Score": GHSave_math, "Ave Reading": GHSave_reading, "% Pass Math": GHSpass_math, "Total Pass Rate": GHSpass_rate},
{"School Name": "Wilson High School", "Type": "Charter", "Total Students": WHStudent_tot, "Total School Budget": "1,319,574", "Budget Per Student": WHSBudper_st, "Ave Math Score": WHSave_math, "Ave Reading": WHSave_reading, "% Pass Math": WHSpass_math, "Total Pass Rate": WHSpass_rate},
{"School Name": "Cabrera High School", "Type": "Charter", "Total Students": CHStudent_tot, "Total School Budget": "1,081,356", "Budget Per Student": CHSBudper_st, "Ave Math Score": CHSave_math, "Ave Reading": CHSave_reading, "% Pass Math": CHSpass_math, "Total Pass Rate": CHSpass_rate},
{"School Name": "Bailey High School", "Type": "District", "Total Students": BHStudent_tot, "Total School Budget": "3,124,928", "Budget Per Student": BHSBudper_st, "Ave Math Score": BHSave_math, "Ave Reading": BHSave_reading, "% Pass Math": BHSpass_math, "Total Pass Rate": BHSpass_rate},
{"School Name": "Holden High School", "Type": "Charter", "Total Students": HOHStudent_tot, "Total School Budget": "248,087", "Budget Per Student": HOHSBudper_st, "Ave Math Score": HOHSave_math, "Ave Reading": HOHSave_reading, "% Pass Math": HOHSpass_math, "Total Pass Rate": HOHSpass_rate},
{"School Name": "Pena High School", "Type": "Charter", "Total Students": PHStudent_tot, "Total School Budget": "585,858", "Budget Per Student": PHSBudper_st, "Ave Math Score": PHSave_math, "Ave Reading": PHSave_reading, "% Pass Math": PHSpass_math, "Total Pass Rate": PHSpass_rate},
{"School Name": "Wright High School", "Type": "Charter", "Total Students": WTHStudent_tot, "Total School Budget": "1,049,400", "Budget Per Student": WTHSBudper_st, "Ave Math Score": WTHSave_math, "Ave Reading": WTHSave_reading, "% Pass Math": WTHSpass_math, "Total Pass Rate": WTHSpass_rate},
{"School Name": "Rodriguez High School", "Type": "District", "Total Students": RHStudent_tot, "Total School Budget": "2,547,363", "Budget Per Student": RHSBudper_st, "Ave Math Score": RHSave_math, "Ave Reading": RHSave_reading, "% Pass Math": RHSpass_math, "Total Pass Rate": RHSpass_rate},
{"School Name": "Johnson High School", "Type": "District", "Total Students": JHStudent_tot, "Total School Budget": "3,094,650", "Budget Per Student": JHSBudper_st, "Ave Math Score": JHSave_math, "Ave Reading": JHSave_reading, "% Pass Math": JHSpass_math, "Total Pass Rate": JHSpass_rate},
{"School Name": "Ford High School", "Type": "District", "Total Students": FDHStudent_tot, "Total School Budget": "1,763,916", "Budget Per Student": FDHSBudper_st, "Ave Math Score": FDHSave_math, "Ave Reading": FDHSave_reading, "% Pass Math": FDHSpass_math, "Total Pass Rate": FDHSpass_rate},
{"School Name": "Thomas High School", "Type": "Charter", "Total Students": THStudent_tot, "Total School Budget": "1,043,130", "Budget Per Student": THSBudper_st, "Ave Math Score": THSave_math, "Ave Reading": THSave_reading, "% Pass Math": THSpass_math, "Total Pass Rate": THSpass_rate}])
School_Summary

,% Pass Math,Ave Math Score,Ave Reading,Budget Per Student,School Name,Total Pass Rate,Total School Budget,Total Students,Type
0,74.108817,76.629414,81.182722,668.521693,Huang High School,78.906068,"1,910,635",2858,District
1,74.284477,76.711767,81.158020,652.949064,Figueroa High School,78.934893,"1,884,411",2886,District
2,84.344074,83.359455,83.725724,607.940161,Shelton High School,83.542589,"1,056,600",1738,Charter
3,75.815152,77.289752,80.934412,671.410798,Hernandez High School,79.112082,"3,022,020",4501,District
4,84.396825,83.351499,83.816757,633.195307,Griffin High School,83.584128,"917,500",1449,Charter
5,84.449288,83.274201,83.989488,586.999110,Wilson High School,83.631844,"1,319,574",2248,Charter
6,84.037077,83.061895,83.975780,589.616140,Cabrera High School,83.518837,"1,081,356",1834,Charter
7,76.020421,77.048432,81.033963,651.162325,Bailey High School,79.041198,"3,124,928",4799,District
8,84.073113,83.803279,83.814988,585.110849,Holden High School,83.809133,"248,087",424,Charter
9,84.454450,83.839917,84.044699,613.463874,Pena High School,83.942308,"585,858",955,Charter
10,84.212563,83.682222,83.955000,588.558609,Wright High School,83.818611,"1,049,400",1783,Charter
11,74.683496,76.842711,80.744686,652.835213,Rodriguez High School,78.793698,"2,547,363",3902,District
12,75.466436,77.072464,80.966394,670.127761,Johnson High School,79.019429,"3,094,650",4618,District
13,74.718236,77.102592,80.746258,659.161435,Ford High School,78.924425,"1,763,916",2676,District
14,83.989500,83.418349,83.848930,644.305127,Thomas High School,83.633639,"1,043,130",1619,Charter

In [154]:
#Top Performing Schools by Passing Rate

In [155]:
#Reset Index to School Name 
Top_df = School_Summary.set_index("School Name")
Top_df.head(2)

,% Pass Math,Ave Math Score,Ave Reading,Budget Per Student,Total Pass Rate,Total School Budget,Total Students,Type
School Name,,,,,,,,
Huang High School,74.108817,76.629414,81.182722,668.521693,78.906068,"1,910,635",2858,District
Figueroa High School,74.284477,76.711767,81.158020,652.949064,78.934893,"1,884,411",2886,District

In [156]:
#Sort and Display the schools by overall passing rate
Top_five = Top_df.sort_values(["Total Pass Rate"], ascending=False)
Top_five

,% Pass Math,Ave Math Score,Ave Reading,Budget Per Student,Total Pass Rate,Total School Budget,Total Students,Type
School Name,,,,,,,,
Pena High School,84.454450,83.839917,84.044699,613.463874,83.942308,"585,858",955,Charter
Wright High School,84.212563,83.682222,83.955000,588.558609,83.818611,"1,049,400",1783,Charter
Holden High School,84.073113,83.803279,83.814988,585.110849,83.809133,"248,087",424,Charter
Thomas High School,83.989500,83.418349,83.848930,644.305127,83.633639,"1,043,130",1619,Charter
Wilson High School,84.449288,83.274201,83.989488,586.999110,83.631844,"1,319,574",2248,Charter
Griffin High School,84.396825,83.351499,83.816757,633.195307,83.584128,"917,500",1449,Charter
Shelton High School,84.344074,83.359455,83.725724,607.940161,83.542589,"1,056,600",1738,Charter
Cabrera High School,84.037077,83.061895,83.975780,589.616140,83.518837,"1,081,356",1834,Charter
Hernandez High School,75.815152,77.289752,80.934412,671.410798,79.112082,"3,022,020",4501,District
Bailey High School,76.020421,77.048432,81.033963,651.162325,79.041198,"3,124,928",4799,District
Johnson High School,75.466436,77.072464,80.966394,670.127761,79.019429,"3,094,650",4618,District
Figueroa High School,74.284477,76.711767,81.158020,652.949064,78.934893,"1,884,411",2886,District
Ford High School,74.718236,77.102592,80.746258,659.161435,78.924425,"1,763,916",2676,District
Huang High School,74.108817,76.629414,81.182722,668.521693,78.906068,"1,910,635",2858,District
Rodriguez High School,74.683496,76.842711,80.744686,652.835213,78.793698,"2,547,363",3902,District

In [157]:
#Identify top performing five Schools by passing rate

Top_passrate = Top_five.iloc[0:5, 4:5]
Top_passrate

                    Total Pass Rate
School Name
Pena High School          83.942308
Wright High School        83.818611
Holden High School        83.809133
Thomas High School        83.633639
Wilson High School        83.631844

In [158]:
#Sort and Display the schools by overall passing rate
Bottom_five = Top_df.sort_values(["Total Pass Rate"], ascending=True)
Bottom_five

,% Pass Math,Ave Math Score,Ave Reading,Budget Per Student,Total Pass Rate,Total School Budget,Total Students,Type
School Name,,,,,,,,
Rodriguez High School,74.683496,76.842711,80.744686,652.835213,78.793698,"2,547,363",3902,District
Huang High School,74.108817,76.629414,81.182722,668.521693,78.906068,"1,910,635",2858,District
Ford High School,74.718236,77.102592,80.746258,659.161435,78.924425,"1,763,916",2676,District
Figueroa High School,74.284477,76.711767,81.158020,652.949064,78.934893,"1,884,411",2886,District
Johnson High School,75.466436,77.072464,80.966394,670.127761,79.019429,"3,094,650",4618,District
Bailey High School,76.020421,77.048432,81.033963,651.162325,79.041198,"3,124,928",4799,District
Hernandez High School,75.815152,77.289752,80.934412,671.410798,79.112082,"3,022,020",4501,District
Cabrera High School,84.037077,83.061895,83.975780,589.616140,83.518837,"1,081,356",1834,Charter
Shelton High School,84.344074,83.359455,83.725724,607.940161,83.542589,"1,056,600",1738,Charter
Griffin High School,84.396825,83.351499,83.816757,633.195307,83.584128,"917,500",1449,Charter
Wilson High School,84.449288,83.274201,83.989488,586.999110,83.631844,"1,319,574",2248,Charter
Thomas High School,83.989500,83.418349,83.848930,644.305127,83.633639,"1,043,130",1619,Charter
Holden High School,84.073113,83.803279,83.814988,585.110849,83.809133,"248,087",424,Charter
Wright High School,84.212563,83.682222,83.955000,588.558609,83.818611,"1,049,400",1783,Charter
Pena High School,84.454450,83.839917,84.044699,613.463874,83.942308,"585,858",955,Charter

In [159]:
#Identify bottom performing five Schools by Passing Rate 

Bottom_passrate = Bottom_five.iloc[0:5, 4:5]
Bottom_passrate

                       Total Pass Rate
School Name
Rodriguez High School        78.793698
Huang High School            78.906068
Ford High School             78.924425
Figueroa High School         78.934893
Johnson High School          79.019429

In [160]:
#Math Scores by Grade - display Math and Reading Scores for each grade level at each school

In [161]:
#Scores by School Spending Per Student 
print(School_Summary["Budget Per Student"].max())
print(School_Summary["Budget Per Student"].min())

671.4107976005332
585.1108490566038

In [162]:
#Define Bins for ranges 
bins = [0, 600, 625, 650, 675]
range_label = ["0 to 600", "600 to 625", "625 to 650", "650 to 675"]

In [163]:
#Cut Data 
pd.cut(School_Summary["Budget Per Student"], bins, labels=range_label).head()

0    650 to 675
1    650 to 675
2    600 to 625
3    650 to 675
4    625 to 650
Name: Budget Per Student, dtype: category
Categories (4, object): [0 to 600 < 600 to 625 < 625 to 650 < 650 to 675]

In [164]:
#Add data to dataframe 
School_Summary["Budget Group"] = pd.cut(School_Summary["Budget Per Student"], bins, labels=range_label)
School_Summary.head()

,% Pass Math,Ave Math Score,Ave Reading,Budget Per Student,School Name,Total Pass Rate,Total School Budget,Total Students,Type,Budget Group
0,74.108817,76.629414,81.182722,668.521693,Huang High School,78.906068,"1,910,635",2858,District,650 to 675
1,74.284477,76.711767,81.158020,652.949064,Figueroa High School,78.934893,"1,884,411",2886,District,650 to 675
2,84.344074,83.359455,83.725724,607.940161,Shelton High School,83.542589,"1,056,600",1738,Charter,600 to 625
3,75.815152,77.289752,80.934412,671.410798,Hernandez High School,79.112082,"3,022,020",4501,District,650 to 675
4,84.396825,83.351499,83.816757,633.195307,Griffin High School,83.584128,"917,500",1449,Charter,625 to 650

In [173]:
#Results of Scores by Budget Group  
all_data_grp = School_Summary.groupby("Budget Group")
print((all_data_grp["School Name"]).count())
all_data_grp[["Ave Math Score", "Ave Reading", "Total Pass Rate", "% Pass Math"]].mean()

Budget Group
0 to 600      4
600 to 625    2
625 to 650    2
650 to 675    7
Name: School Name, dtype: int64

              Ave Math Score  Ave Reading  Total Pass Rate  % Pass Math
Budget Group
0 to 600           83.455399    83.933814        83.694607    84.193010
600 to 625         83.599686    83.885211        83.742449    84.399262
625 to 650         83.384924    83.832844        83.608884    84.193163
650 to 675         76.956733    80.966636        78.961685    75.013862

In [175]:
#Scores by School Size 

print(School_Summary["Total Students"].max())
print(School_Summary["Total Students"].min())

4799
424

In [167]:
##Define Bins for ranges 
bins = [0, 500, 1000, 1500, 2000, 3000, 4000, 5000]
range_label = ["0 to 500", "500 to 1000", "1000 to 1500", "1500 to 2000", "2000 to 3000", "3000 to 4000", "4000 to 5000"]

In [176]:
#Cut Data 
pd.cut(School_Summary["Total Students"], bins, labels=range_label).head()

0    2000 to 3000
1    2000 to 3000
2    1500 to 2000
3    4000 to 5000
4    1000 to 1500
Name: Total Students, dtype: category
Categories (7, object): [0 to 500 < 500 to 1000 < 1000 to 1500 < 1500 to 2000 < 2000 to 3000 < 3000 to 4000 < 4000 to 5000]

In [177]:
#Add data to dataframe 
School_Summary["Size Group"] = pd.cut(School_Summary["Total Students"], bins, labels=range_label)
School_Summary.head()

,% Pass Math,Ave Math Score,Ave Reading,Budget Per Student,School Name,Total Pass Rate,Total School Budget,Total Students,Type,Budget Group,Size Group
0,74.108817,76.629414,81.182722,668.521693,Huang High School,78.906068,"1,910,635",2858,District,650 to 675,2000 to 3000
1,74.284477,76.711767,81.158020,652.949064,Figueroa High School,78.934893,"1,884,411",2886,District,650 to 675,2000 to 3000
2,84.344074,83.359455,83.725724,607.940161,Shelton High School,83.542589,"1,056,600",1738,Charter,600 to 625,1500 to 2000
3,75.815152,77.289752,80.934412,671.410798,Hernandez High School,79.112082,"3,022,020",4501,District,650 to 675,4000 to 5000
4,84.396825,83.351499,83.816757,633.195307,Griffin High School,83.584128,"917,500",1449,Charter,625 to 650,1000 to 1500

In [178]:
#Results of Scores by Size
School_Summary_grp = School_Summary.groupby("Size Group")
print((School_Summary_grp["School Name"]).count())
School_Summary_grp[["Ave Math Score", "Ave Reading", "Total Pass Rate", "% Pass Math"]].mean()

Size Group
0 to 500        1
500 to 1000     1
1000 to 1500    1
1500 to 2000    4
2000 to 3000    4
3000 to 4000    1
4000 to 5000    3
Name: School Name, dtype: int64

              Ave Math Score  Ave Reading  Total Pass Rate  % Pass Math
Size Group
0 to 500           83.803279    83.814988        83.809133    84.073113
500 to 1000        83.839917    84.044699        83.942308    84.454450
1000 to 1500       83.351499    83.816757        83.584128    84.396825
1500 to 2000       83.380480    83.876359        83.628419    84.145803
2000 to 3000       78.429493    81.769122        80.099308    76.890205
3000 to 4000       76.842711    80.744686        78.793698    74.683496
4000 to 5000       77.136883    80.978256        79.057569    75.767336

In [179]:
#Scores by School Type 
print(School_Summary["Type"].max())
print(School_Summary["Type"].min())

District
Charter

In [181]:
#Results of Scores by Type
School_sum_grp = School_Summary.groupby("Type")
print((School_sum_grp["School Name"]).count())
School_sum_grp[["Ave Math Score", "Ave Reading", "Total Pass Rate", "% Pass Math"]].mean()

Type
Charter     8
District    7
Name: School Name, dtype: int64

          Ave Math Score  Ave Reading  Total Pass Rate  % Pass Math
Type
Charter        83.473852    83.896421        83.685136    84.244611
District       76.956733    80.966636        78.961685    75.013862